content/notes/git.org
:PROPERTIES:
:ID:       8fe08bc8-ad1e-458d-ac5f-77243216932f
:END:
#+title: Git
#+date: [2022-03-16 Wed 20:07]

* Git
Software collaboration tool created by Linus Torvalds 17 years ago.
** Setting up Git
When setting up Git, we may fall into a problem when sshing into their servers.
Luckily, there is a post about how to solve this: [[https://gist.github.com/Tamal/1cc77f88ef3e900aeae65f0e5e504794][Git Post]]
You can also use my Guix post-installation script.
** Github
Github is the most popular git hosting platform in the world.
There are many other alternatives like Sourcehut, Gitlab and savannah that [[id:4ce84157-a404-40fa-bdb8-0b3923916969][Guix]] uses. 

Git [[id:07ab67b2-028c-4ce8-8ff3-9df904c4aa99][SSHs]] into Github's servers and manages your program files.
Github can also use your [[id:b69627d6-3ade-4eba-9e19-23a40248b3cb][GPG]] keys to sign commits. (I never use this feature though).
