notes/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Git</h1>

<div id="outline-container-org0c03342" class="outline-2">
<h2 id="org0c03342">Git</h2>
<div class="outline-text-2" id="text-org0c03342">
<p>
Software collaboration tool created by Linus Torvalds 17 years ago.
</p>
</div>
<div id="outline-container-org1d5b2a5" class="outline-3">
<h3 id="org1d5b2a5">Setting up Git</h3>
<div class="outline-text-3" id="text-org1d5b2a5">
<p>
When setting up Git, we may fall into a problem when sshing into their servers.
Luckily, there is a post about how to solve this: <a target='_blank' rel='noopener noreferrer' class='external' href="https://gist.github.com/Tamal/1cc77f88ef3e900aeae65f0e5e504794">Git Post</a>
You can also use my Guix post-installation script.
</p>
</div>
</div>
<div id="outline-container-org7851b30" class="outline-3">
<h3 id="org7851b30">Github</h3>
<div class="outline-text-3" id="text-org7851b30">
<p>
Github is the most popular git hosting platform in the world.
There are many other alternatives like Sourcehut, Gitlab and savannah that <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a> uses. 
</p>

<p>
Git <a href="ssh.html#ID-07ab67b2-028c-4ce8-8ff3-9df904c4aa99">SSHs</a> into Github's servers and manages your program files.
Github can also use your <a href="gpg.html#ID-b69627d6-3ade-4eba-9e19-23a40248b3cb">GPG</a> keys to sign commits. (I never use this feature though).
</p>
</div>
</div>
</div>

<div id="outline-container-org39aaf7b" class="outline-2">
<h2 id="org39aaf7b">Links to this note</h2>
<div class="outline-text-2" id="text-org39aaf7b">
<ul class="org-ul">
<li><a href="./programming.html">Programming</a></li>
<li><a href="./gpg.html">GPG</a></li>
<li><a href="./gpg.html">GPG</a></li>
<li><a href="./programming.html">Programming</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
